import React from "react";

function DEV_ADMIN_STUDPANEL() {
  return <div></div>;
}

export default DEV_ADMIN_STUDPANEL;


// что может админ
// - просматривать преподов и студентов в одном окне
//     - добавлять студентов преподов и админов
//     - удалять студентов преподов и админов
//     - редактировать преподов и студентов


// - выдавать детали студентам и менять детали студентам
// - добавлять и удалять детали в пулле деталей

// - создавать группы и просматривать группы + архивировать группы и добавлять в них студентов
// - дать управление над группой преподавателю
// - препод может добавлять студентов без группы в свои группы


// что может препод и админ в плане управления студентиками
// - смотреть задания студентов т.е. скачать их из сданных заданий
// - комментить задания студентов
// - ставаить оценку за задание
// - менять детали
// - ставить зачеты и незачеты
// - добавлять студентов в группы
// - архивировать группы
// - искать группы и искать студента